# Transition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ContinuousRailType..::..Transition Property
ContinuousRailType Class See Also
---
The transition option of the rail.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public RailTransitionOption Transition { get; set; }
```

Visual Basic
---
```text
Public Property Transition As RailTransitionOption
	Get
	Set
```

Visual C++
---
```text
public:
property RailTransitionOption Transition {
	RailTransitionOption get ();
	void set (RailTransitionOption value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ContinuousRailType Class
Autodesk.Revit.DB.Architecture Namespace